"use client";
import { useDispatch, useSelector } from "react-redux";
import "./footer.css";
import Link from "next/link";
import { toggleSignIn, toggleSignUp } from "../GlobalState/Features/authSlice";
import { toast } from "react-toastify";

const Footer = () => {
  const dispatch = useDispatch();
  const userInfo = useSelector((store) => store.userData.info);
  const {
    phone,
    email,
    linkedinURL,
    twitterURL,
    facebookURL,
    googleURL,
  } = useSelector((store) => store.dataContent.homeData);
  function handleSignIn() {
    if (userInfo) toast.error("انت مسجل بالفعل");
    else dispatch(toggleSignIn());
  }
  function handleSignUp() {
    if (userInfo) toast.error("انت مسجل بالفعل");
    else dispatch(toggleSignUp());
  }
  return (
    <footer className="bg-[#303030] p-10">
      <ul className="container text-white flex-col gap-6 md:gap-0 flex md:flex-row justify-between items-start max-w-screen-lg mx-auto">
        <li className="max-w-[370px]">
          <img loading="lazy" src="/media/logos/abad-logo.png" className="max-w-44" alt="" />
          <p className="noto my-3 leading-normal">
            ومعهد شبكة آباد للتدريب من المعاهد الرائدة في تقديم الدورات
            التطويرية المتخصصة في تقنية المعلومات. معهد شبكة آباد للتدريب من
            المعاهد الرائدة في تقديم الدورات التطويرية المتخصصة في تقنية
            المعلومات.
          </p>
          <div className="social-links flex gap-5">
            <a href={linkedinURL}>
              <svg
                className="linkedin"
                xmlns="http://www.w3.org/2000/svg"
                width={17}
                height={17}
                viewBox="0 0 17 17"
                fill="none"
              >
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M6.07479 6.10013H9.11421V7.56472C9.55204 6.72238 10.6748 5.96555 12.3615 5.96555C15.5949 5.96555 16.3625 7.6423 16.3625 10.7187V16.4163H13.089V11.4193C13.089 9.66738 12.6512 8.67938 11.5366 8.67938C9.99069 8.67938 9.34827 9.74417 9.34827 11.4185V16.4163H6.07479V6.10013ZM0.461588 16.2818H3.73507V5.96555H0.461588V16.2818ZM4.20399 2.60176C4.20411 2.86718 4.1497 3.12999 4.04391 3.37489C3.93812 3.61979 3.78307 3.84191 3.58776 4.02834C3.192 4.40884 2.6563 4.62182 2.09833 4.62051C1.54134 4.62015 1.00688 4.40771 0.610531 4.02913C0.415932 3.84207 0.261403 3.6197 0.155799 3.37477C0.0501947 3.12983 -0.00440887 2.86714 -0.00488281 2.60176C-0.00488281 2.0658 0.216077 1.5528 0.61135 1.17438C1.00735 0.7953 1.54203 0.582771 2.09915 0.583008C2.65727 0.583008 3.19249 0.795966 3.58776 1.17438C3.98222 1.5528 4.20399 2.0658 4.20399 2.60176Z"
                  fill="#007BB6"
                />
              </svg>
            </a>
            {/* TODO: add pinterest  */}
            <a href={googleURL}>
              <svg
                className="pinterest"
                xmlns="http://www.w3.org/2000/svg"
                width={14}
                height={17}
                viewBox="0 0 14 17"
                fill="none"
              >
                <path
                  d="M7.1002 0.900391C2.77921 0.900391 0.520508 3.56039 0.520508 6.50539C0.520508 7.93039 1.30614 9.35539 2.5828 10.1154C2.97562 10.3054 2.87741 10.1154 3.17203 8.97539C3.17203 8.88039 3.17203 8.78539 3.07382 8.69039C1.30614 6.60039 2.77921 2.51539 6.90379 2.51539C12.8943 2.51539 11.7158 10.4954 7.98404 10.4954C7.19841 10.5904 6.51098 10.0204 6.51098 9.26039V8.88039C6.90379 7.83539 7.19841 6.88539 7.29661 5.84039C7.29661 3.84539 4.25227 4.13039 4.25227 6.79039C4.25227 7.26539 4.35048 7.74039 4.54689 8.12039C4.54689 8.12039 3.56484 12.0154 3.36844 12.6804C3.17203 13.8204 3.27023 14.9604 3.46664 16.0054C3.36844 16.1004 3.46664 16.1004 3.46664 16.1004H3.56484C4.25227 15.1504 4.8415 14.2004 5.23432 13.1554C5.33252 12.6804 5.82354 10.9704 5.82354 10.9704C6.31457 11.6354 7.19841 12.0154 8.08225 12.0154C11.1266 12.0154 13.2871 9.45039 13.2871 6.31539C13.2871 3.18039 10.5374 0.900391 7.1002 0.900391Z"
                  fill="#CB2056"
                />
              </svg>
            </a>
            <a href={googleURL}>
              <svg
                className="google"
                xmlns="http://www.w3.org/2000/svg"
                width={20}
                height={14}
                viewBox="0 0 20 14"
                fill="none"
              >
                <path
                  d="M11.6464 5.77241C11.7026 6.1021 11.7428 6.43179 11.7428 6.85945C11.7428 10.5929 9.48397 13.2393 6.08367 13.2393C2.82807 13.2393 0.191406 10.3167 0.191406 6.70801C0.191406 3.09932 2.82807 0.176758 6.08367 0.176758C7.67532 0.176758 9.00166 0.818283 10.0306 1.88754L8.43091 3.5894C7.99681 3.12606 7.23318 2.58254 6.08367 2.58254C4.07404 2.58254 2.43415 4.42697 2.43415 6.70801C2.43415 8.98905 4.07404 10.8335 6.08367 10.8335C8.41483 10.8335 9.29106 8.97122 9.42768 8.0178H6.08367V5.77237H11.6464V5.77241ZM17.3363 5.99137V4.09551H15.6177V5.99137H13.9073V7.89635H15.6177V9.79222H17.3363V7.89635H19.0466V5.99137H17.3363Z"
                  fill="#F04D3F"
                />
              </svg>
            </a>
            <a href={facebookURL}>
              <svg
                className="facebook"
                xmlns="http://www.w3.org/2000/svg"
                width={9}
                height={15}
                viewBox="0 0 9 15"
                fill="none"
              >
                <path
                  d="M5.47904 14.6229V8.13438H7.74183L8.07818 5.59392H5.47904V3.97576C5.47904 3.24267 5.69018 2.74076 6.77779 2.74076H8.15593V0.475798C7.48538 0.406282 6.81138 0.372717 6.13701 0.375256C4.13691 0.375256 2.76369 1.55642 2.76369 3.7248V5.58917H0.515625V8.12963H2.7686V14.6229H5.47904Z"
                  fill="#3F7BF8"
                />
              </svg>
            </a>
            <a href={twitterURL}>
              <svg
                className="twitter"
                xmlns="http://www.w3.org/2000/svg"
                width={19}
                height={15}
                viewBox="0 0 19 15"
                fill="none"
              >
                <path
                  d="M18.5819 1.90915C17.8986 2.20207 17.1645 2.39998 16.3928 2.48944C17.189 2.02853 17.7848 1.3031 18.0688 0.448525C17.3207 0.878392 16.5019 1.18097 15.6481 1.34311C15.0739 0.750043 14.3133 0.35695 13.4845 0.224859C12.6558 0.0927673 11.8051 0.229068 11.0646 0.6126C10.324 0.996132 9.73514 1.60544 9.38928 2.34592C9.04342 3.08639 8.95995 3.91662 9.15183 4.70769C7.63595 4.63406 6.15302 4.25292 4.79927 3.58899C3.44552 2.92506 2.25121 1.99319 1.29384 0.853858C0.966495 1.40011 0.77827 2.03344 0.77827 2.70794C0.777905 3.31515 0.932477 3.91305 1.22827 4.4486C1.52407 4.98416 1.95194 5.4408 2.47393 5.77802C1.86856 5.75939 1.27655 5.60115 0.747172 5.31648V5.36398C0.747111 6.21561 1.05163 7.04103 1.60906 7.70019C2.1665 8.35934 2.94251 8.81164 3.80542 8.98032C3.24384 9.12734 2.65507 9.149 2.08357 9.04365C2.32703 9.77643 2.80128 10.4172 3.43991 10.8763C4.07854 11.3354 4.84959 11.5898 5.64512 11.6039C4.29467 12.6294 2.62687 13.1857 0.910027 13.1833C0.605906 13.1834 0.302041 13.1662 0 13.1318C1.7427 14.2157 3.77133 14.791 5.84316 14.7888C12.8566 14.7888 16.6907 9.16952 16.6907 4.29602C16.6907 4.13769 16.6866 3.97777 16.6792 3.81944C17.425 3.29771 18.0687 2.65165 18.5803 1.91153L18.5819 1.90915Z"
                  fill="#10ADED"
                />
              </svg>
            </a>
          </div>
        </li>
        <li className="footer-pages">
          <h4>الصفحات</h4>
          <Link href="/">الصفحة الرئيسية</Link>
          <Link href="/courses">الدورات</Link>
          <Link href="/articles">المقالات</Link>
          <Link href="/privacy">الاعتمادات والشركاء</Link>
          <Link href="/contact">اتصل بنا</Link>
        </li>
        <li className="footer-general">
          <h4>نظرة عامة</h4>
          <Link href="/privacy">الخصوصية و الاستخدام</Link>
          <button onClick={handleSignIn}>تسجيل الدخول</button>
          <button onClick={handleSignUp}>التسجيل</button>
        </li>
        <li className="footer-contact">
          <h4>يتصل:</h4>
          <a href={`tel:${phone}`} dir="ltr" className="w-fit">
            {phone}
          </a>
          <a href={`mailto:${email}`}>{email}</a>
        </li>
      </ul>
    </footer>
  );
};

export default Footer;
